In [16]:
import pandas as pd
import xlrd

In [17]:
titles = pd.read_csv('netflix_titles.csv')
titles.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,81145628,Movie,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","Alan Marriott, Andrew Toth, Brian Dobson, Cole...","United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,"Children & Family Movies, Comedies",Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,NaN,Jandino Asporaat,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,Stand-Up Comedy,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,Kids' TV,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,NaN,"Will Friedle, Darren Criss, Constance Zimmer, ...",United States,"September 8, 2018",2016,TV-Y7,1 Season,Kids' TV,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017,TV-14,99 min,Comedies,When nerdy high schooler Dani finally attracts...

In [19]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6234 entries, 0 to 6233
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       6234 non-null   int64
 1   type          6234 non-null   object
 2   title         6234 non-null   object
 3   director      4265 non-null   object
 4   cast          5664 non-null   object
 5   country       5758 non-null   object
 6   date_added    6223 non-null   object
 7   release_year  6234 non-null   int64
 8   rating        6224 non-null   object
 9   duration      6234 non-null   object
 10  listed_in     6234 non-null   object
 11  description   6234 non-null   object
dtypes: int64(2), object(10)
memory usage: 584.6+ KB

In [20]:
titles.columns

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description'],
      dtype='object')

In [21]:
time_use = pd.read_excel('Time-Use-in-OECD-Countries-OECD.xlsx')

In [22]:
time_use

          Country                  Category  Time (minutes)
0       Australia                 Paid work      211.146630
1         Austria                 Paid work      279.532268
2         Belgium                 Paid work      194.476452
3          Canada                 Paid work      268.660610
4         Denmark                 Paid work      199.771596
..            ...                       ...             ...
456            UK  Other leisure activities       98.407710
457           USA  Other leisure activities       73.490920
458         China  Other leisure activities       52.963220
459         India  Other leisure activities      109.193439
460  South Africa  Other leisure activities       81.824600

[461 rows x 3 columns]

In [25]:
time_use.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 461 entries, 0 to 460
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country         461 non-null    object
 1   Category        461 non-null    object
 2   Time (minutes)  461 non-null    float64
dtypes: float64(1), object(2)
memory usage: 10.9+ KB

In [23]:
time_use.Category.unique()

array(['Paid work', 'Education', 'Care for household members ',
       'Housework', 'Shopping', 'Other unpaid work & volunteering',
       'Sleep', 'Eating and drinking', 'Personal care', 'Sports',
       'Attending events', 'Seeing friends', 'TV and Radio',
       'Other leisure activities'], dtype=object)